# Задача 8 — Решение в Python

# Въвеждане на реално число
x = float(input("Въведете положително реално число: "))

# Вземаме дробната част → x - цяло число от x
drobna_chast = x - int(x)

# Умножаваме по 100, за да изведем втората цифра след десетичната точка
drobna_do_vtora_cifra = int(drobna_chast * 100)

# Вземаме втората цифра (единиците от числото)
a = drobna_do_vtora_cifra % 10

# Извеждане в поле с ширина 5, подравнено надясно
print(f"{a:>5}")
