# Задача 5 — Решение в Python

# Първо въвеждаме като текст
n_text = input("Въведете четирицифрено число (напр. 1234): ")

# После го преобразуваме в цяло число
n = int(n_text)

# Извличане на цифрите
хил = n // 1000              # хиляди
стот = (n // 100) % 10       # стотици
дес = (n // 10) % 10         # десетици
ед = n % 10                 # единици

# Изчисляване на сумата и произведението
сума = хил + стот + дес + ед
произведение = хил * стот * дес * ед

# Извеждане на резултата
print("Сума на цифрите:", сума)
print("Произведение на цифрите:", произведение)
