# Задача 7 — Решение в Python

# Въвеждане на осемцифрено число
n_text = input("Въведете осемцифрено число: ")

# Инициализиране на сума и брой цифри
suma = 0
broi_cifri = len(n_text)  # Трябва да е 8, но работи и за всякакви дължини

# Обхождане на всяка цифра
for cifra in n_text:
    suma += int(cifra)

# Изчисляване на средноаритметичното
sredno = suma / broi_cifri

# Извеждане на резултата
print("Средноаритметичното на цифрите е:", sredno)
