# Задача 3 — Решение в Python

# Въвеждане на числото
k = int(input("Въведете цяло число k: "))

# Пресмятане на булевия израз:
# !( (k + 325) % 2 == 1 ) в C++
# → В Python "!" е "not"

result = not ( (k + 325) % 2 == 1 )

# Извеждане на резултата
print("Резултат:", result)
