# Задача 4 — Решение в Python

# Първо въвеждаме като текст
n_text = input("Въведете трицифрено число (напр. 532): ")

# После го преобразуваме в цяло число
n = int(n_text)

# Извличане на цифрите
sotni = n // 100            # Стотици
desetici = (n // 10) % 10   # Десетици
edinici = n % 10            # Единици

# Съставяне на обратното число
obratno = edinici * 100 + desetici * 10 + sotni

# Извеждане на резултата
print("Числото в обратен ред е:", obratno)
